


================= Micronet Deep Learning Vision =================
Version: 0.2
Author: Luong Chan Hiep
Email: hiep.lchan@gmail.com
-----------------------------------------------
Working on GPU
CUDA devices count: 1
CUDA devices name: GeForce GTX 1080
=================================================================



========================= MODEL SUMMARY =========================
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 112, 112]             864
       BatchNorm2d-2         [-1, 32, 112, 112]              64
             ReLU6-3         [-1, 32, 112, 112]               0
            Conv2d-4         [-1, 32, 112, 112]             288
       BatchNorm2d-5         [-1, 32, 112, 112]              64
             ReLU6-6         [-1, 32, 112, 112]               0
            Conv2d-7         [-1, 16, 112, 112]             512
       BatchNorm2d-8         [-1, 16, 112, 112]              32
  InvertedResidual-9         [-1, 16, 112, 112]               0
           Conv2d-10         [-1, 96, 112, 112]           1,536
      BatchNorm2d-11         [-1, 96, 112, 112]             192
            ReLU6-12         [-1, 96, 112, 112]               0
           Conv2d-13           [-1, 96, 56, 56]             864
      BatchNorm2d-14           [-1, 96, 56, 56]             192
            ReLU6-15           [-1, 96, 56, 56]               0
           Conv2d-16           [-1, 24, 56, 56]           2,304
      BatchNorm2d-17           [-1, 24, 56, 56]              48
 InvertedResidual-18           [-1, 24, 56, 56]               0
           Conv2d-19          [-1, 144, 56, 56]           3,456
      BatchNorm2d-20          [-1, 144, 56, 56]             288
            ReLU6-21          [-1, 144, 56, 56]               0
           Conv2d-22          [-1, 144, 56, 56]           1,296
      BatchNorm2d-23          [-1, 144, 56, 56]             288
            ReLU6-24          [-1, 144, 56, 56]               0
           Conv2d-25           [-1, 24, 56, 56]           3,456
      BatchNorm2d-26           [-1, 24, 56, 56]              48
 InvertedResidual-27           [-1, 24, 56, 56]               0
           Conv2d-28          [-1, 144, 56, 56]           3,456
      BatchNorm2d-29          [-1, 144, 56, 56]             288
            ReLU6-30          [-1, 144, 56, 56]               0
           Conv2d-31          [-1, 144, 28, 28]           1,296
      BatchNorm2d-32          [-1, 144, 28, 28]             288
            ReLU6-33          [-1, 144, 28, 28]               0
           Conv2d-34           [-1, 32, 28, 28]           4,608
      BatchNorm2d-35           [-1, 32, 28, 28]              64
 InvertedResidual-36           [-1, 32, 28, 28]               0
           Conv2d-37          [-1, 192, 28, 28]           6,144
      BatchNorm2d-38          [-1, 192, 28, 28]             384
            ReLU6-39          [-1, 192, 28, 28]               0
           Conv2d-40          [-1, 192, 28, 28]           1,728
      BatchNorm2d-41          [-1, 192, 28, 28]             384
            ReLU6-42          [-1, 192, 28, 28]               0
           Conv2d-43           [-1, 32, 28, 28]           6,144
      BatchNorm2d-44           [-1, 32, 28, 28]              64
 InvertedResidual-45           [-1, 32, 28, 28]               0
           Conv2d-46          [-1, 192, 28, 28]           6,144
      BatchNorm2d-47          [-1, 192, 28, 28]             384
            ReLU6-48          [-1, 192, 28, 28]               0
           Conv2d-49          [-1, 192, 28, 28]           1,728
      BatchNorm2d-50          [-1, 192, 28, 28]             384
            ReLU6-51          [-1, 192, 28, 28]               0
           Conv2d-52           [-1, 32, 28, 28]           6,144
      BatchNorm2d-53           [-1, 32, 28, 28]              64
 InvertedResidual-54           [-1, 32, 28, 28]               0
           Conv2d-55          [-1, 192, 28, 28]           6,144
      BatchNorm2d-56          [-1, 192, 28, 28]             384
            ReLU6-57          [-1, 192, 28, 28]               0
           Conv2d-58          [-1, 192, 14, 14]           1,728
      BatchNorm2d-59          [-1, 192, 14, 14]             384
            ReLU6-60          [-1, 192, 14, 14]               0
           Conv2d-61           [-1, 64, 14, 14]          12,288
      BatchNorm2d-62           [-1, 64, 14, 14]             128
 InvertedResidual-63           [-1, 64, 14, 14]               0
           Conv2d-64          [-1, 384, 14, 14]          24,576
      BatchNorm2d-65          [-1, 384, 14, 14]             768
            ReLU6-66          [-1, 384, 14, 14]               0
           Conv2d-67          [-1, 384, 14, 14]           3,456
      BatchNorm2d-68          [-1, 384, 14, 14]             768
            ReLU6-69          [-1, 384, 14, 14]               0
           Conv2d-70           [-1, 64, 14, 14]          24,576
      BatchNorm2d-71           [-1, 64, 14, 14]             128
 InvertedResidual-72           [-1, 64, 14, 14]               0
           Conv2d-73          [-1, 384, 14, 14]          24,576
      BatchNorm2d-74          [-1, 384, 14, 14]             768
            ReLU6-75          [-1, 384, 14, 14]               0
           Conv2d-76          [-1, 384, 14, 14]           3,456
      BatchNorm2d-77          [-1, 384, 14, 14]             768
            ReLU6-78          [-1, 384, 14, 14]               0
           Conv2d-79           [-1, 64, 14, 14]          24,576
      BatchNorm2d-80           [-1, 64, 14, 14]             128
 InvertedResidual-81           [-1, 64, 14, 14]               0
           Conv2d-82          [-1, 384, 14, 14]          24,576
      BatchNorm2d-83          [-1, 384, 14, 14]             768
            ReLU6-84          [-1, 384, 14, 14]               0
           Conv2d-85          [-1, 384, 14, 14]           3,456
      BatchNorm2d-86          [-1, 384, 14, 14]             768
            ReLU6-87          [-1, 384, 14, 14]               0
           Conv2d-88           [-1, 64, 14, 14]          24,576
      BatchNorm2d-89           [-1, 64, 14, 14]             128
 InvertedResidual-90           [-1, 64, 14, 14]               0
           Conv2d-91          [-1, 384, 14, 14]          24,576
      BatchNorm2d-92          [-1, 384, 14, 14]             768
            ReLU6-93          [-1, 384, 14, 14]               0
           Conv2d-94          [-1, 384, 14, 14]           3,456
      BatchNorm2d-95          [-1, 384, 14, 14]             768
            ReLU6-96          [-1, 384, 14, 14]               0
           Conv2d-97           [-1, 96, 14, 14]          36,864
      BatchNorm2d-98           [-1, 96, 14, 14]             192
 InvertedResidual-99           [-1, 96, 14, 14]               0
          Conv2d-100          [-1, 576, 14, 14]          55,296
     BatchNorm2d-101          [-1, 576, 14, 14]           1,152
           ReLU6-102          [-1, 576, 14, 14]               0
          Conv2d-103          [-1, 576, 14, 14]           5,184
     BatchNorm2d-104          [-1, 576, 14, 14]           1,152
           ReLU6-105          [-1, 576, 14, 14]               0
          Conv2d-106           [-1, 96, 14, 14]          55,296
     BatchNorm2d-107           [-1, 96, 14, 14]             192
InvertedResidual-108           [-1, 96, 14, 14]               0
          Conv2d-109          [-1, 576, 14, 14]          55,296
     BatchNorm2d-110          [-1, 576, 14, 14]           1,152
           ReLU6-111          [-1, 576, 14, 14]               0
          Conv2d-112          [-1, 576, 14, 14]           5,184
     BatchNorm2d-113          [-1, 576, 14, 14]           1,152
           ReLU6-114          [-1, 576, 14, 14]               0
          Conv2d-115           [-1, 96, 14, 14]          55,296
     BatchNorm2d-116           [-1, 96, 14, 14]             192
InvertedResidual-117           [-1, 96, 14, 14]               0
          Conv2d-118          [-1, 576, 14, 14]          55,296
     BatchNorm2d-119          [-1, 576, 14, 14]           1,152
           ReLU6-120          [-1, 576, 14, 14]               0
          Conv2d-121            [-1, 576, 7, 7]           5,184
     BatchNorm2d-122            [-1, 576, 7, 7]           1,152
           ReLU6-123            [-1, 576, 7, 7]               0
          Conv2d-124            [-1, 160, 7, 7]          92,160
     BatchNorm2d-125            [-1, 160, 7, 7]             320
InvertedResidual-126            [-1, 160, 7, 7]               0
          Conv2d-127            [-1, 960, 7, 7]         153,600
     BatchNorm2d-128            [-1, 960, 7, 7]           1,920
           ReLU6-129            [-1, 960, 7, 7]               0
          Conv2d-130            [-1, 960, 7, 7]           8,640
     BatchNorm2d-131            [-1, 960, 7, 7]           1,920
           ReLU6-132            [-1, 960, 7, 7]               0
          Conv2d-133            [-1, 160, 7, 7]         153,600
     BatchNorm2d-134            [-1, 160, 7, 7]             320
InvertedResidual-135            [-1, 160, 7, 7]               0
          Conv2d-136            [-1, 960, 7, 7]         153,600
     BatchNorm2d-137            [-1, 960, 7, 7]           1,920
           ReLU6-138            [-1, 960, 7, 7]               0
          Conv2d-139            [-1, 960, 7, 7]           8,640
     BatchNorm2d-140            [-1, 960, 7, 7]           1,920
           ReLU6-141            [-1, 960, 7, 7]               0
          Conv2d-142            [-1, 160, 7, 7]         153,600
     BatchNorm2d-143            [-1, 160, 7, 7]             320
InvertedResidual-144            [-1, 160, 7, 7]               0
          Conv2d-145            [-1, 960, 7, 7]         153,600
     BatchNorm2d-146            [-1, 960, 7, 7]           1,920
           ReLU6-147            [-1, 960, 7, 7]               0
          Conv2d-148            [-1, 960, 7, 7]           8,640
     BatchNorm2d-149            [-1, 960, 7, 7]           1,920
           ReLU6-150            [-1, 960, 7, 7]               0
          Conv2d-151            [-1, 320, 7, 7]         307,200
     BatchNorm2d-152            [-1, 320, 7, 7]             640
InvertedResidual-153            [-1, 320, 7, 7]               0
          Conv2d-154           [-1, 1280, 7, 7]         409,600
     BatchNorm2d-155           [-1, 1280, 7, 7]           2,560
           ReLU6-156           [-1, 1280, 7, 7]               0
         Dropout-157                 [-1, 1280]               0
          Linear-158                 [-1, 1000]       1,281,000
================================================================
Total params: 3,504,872
Trainable params: 3,504,872
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.57
Forward/backward pass size (MB): 152.87
Params size (MB): 13.37
Estimated Total Size (MB): 166.81
----------------------------------------------------------------



========================= MODEL REPORT ==========================
MobileNetV2(
  0.32 GMac, 100.000% MACs,
  (features): Sequential(
    0.319 GMac, 99.600% MACs,
    (0): ConvBNReLU(
      0.012 GMac, 3.760% MACs,
      (0): Conv2d(0.011 GMac, 3.384% MACs, 3, 32, kernel_size=(3, 3), stride=(2, 2), padding=(1, 1), bias=False)
      (1): BatchNorm2d(0.001 GMac, 0.251% MACs, 32, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (2): ReLU6(0.0 GMac, 0.125% MACs, inplace)
    )
    (1): InvertedResidual(
      0.012 GMac, 3.635% MACs,
      (conv): Sequential(
        0.012 GMac, 3.635% MACs,
        (0): ConvBNReLU(
          0.005 GMac, 1.504% MACs,
          (0): Conv2d(0.004 GMac, 1.128% MACs, 32, 32, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), groups=32, bias=False)
          (1): BatchNorm2d(0.001 GMac, 0.251% MACs, 32, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (2): ReLU6(0.0 GMac, 0.125% MACs, inplace)
        )
        (1): Conv2d(0.006 GMac, 2.006% MACs, 32, 16, kernel_size=(1, 1), stride=(1, 1), bias=False)
        (2): BatchNorm2d(0.0 GMac, 0.125% MACs, 16, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      )
    )
    (2): InvertedResidual(
      0.034 GMac, 10.576% MACs,
      (conv): Sequential(
        0.034 GMac, 10.576% MACs,
        (0): ConvBNReLU(
          0.023 GMac, 7.145% MACs,
          (0): Conv2d(0.019 GMac, 6.017% MACs, 16, 96, kernel_size=(1, 1), stride=(1, 1), bias=False)
          (1): BatchNorm2d(0.002 GMac, 0.752% MACs, 96, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (2): ReLU6(0.001 GMac, 0.376% MACs, inplace)
        )
        (1): ConvBNReLU(
          0.004 GMac, 1.128% MACs,
          (0): Conv2d(0.003 GMac, 0.846% MACs, 96, 96, kernel_size=(3, 3), stride=(2, 2), padding=(1, 1), groups=96, bias=False)
          (1): BatchNorm2d(0.001 GMac, 0.188% MACs, 96, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (2): ReLU6(0.0 GMac, 0.094% MACs, inplace)
        )
        (2): Conv2d(0.007 GMac, 2.256% MACs, 96, 24, kernel_size=(1, 1), stride=(1, 1), bias=False)
        (3): BatchNorm2d(0.0 GMac, 0.047% MACs, 24, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      )
    )
    (3): InvertedResidual(
      0.029 GMac, 8.931% MACs,
      (conv): Sequential(
        0.029 GMac, 8.931% MACs,
        (0): ConvBNReLU(
          0.012 GMac, 3.807% MACs,
          (0): Conv2d(0.011 GMac, 3.384% MACs, 24, 144, kernel_size=(1, 1), stride=(1, 1), bias=False)
          (1): BatchNorm2d(0.001 GMac, 0.282% MACs, 144, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (2): ReLU6(0.0 GMac, 0.141% MACs, inplace)
        )
        (1): ConvBNReLU(
          0.005 GMac, 1.692% MACs,
          (0): Conv2d(0.004 GMac, 1.269% MACs, 144, 144, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), groups=144, bias=False)
          (1): BatchNorm2d(0.001 GMac, 0.282% MACs, 144, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (2): ReLU6(0.0 GMac, 0.141% MACs, inplace)
        )
        (2): Conv2d(0.011 GMac, 3.384% MACs, 144, 24, kernel_size=(1, 1), stride=(1, 1), bias=False)
        (3): BatchNorm2d(0.0 GMac, 0.047% MACs, 24, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      )
    )
    (4): InvertedResidual(
      0.017 GMac, 5.374% MACs,
      (conv): Sequential(
        0.017 GMac, 5.374% MACs,
        (0): ConvBNReLU(
          0.012 GMac, 3.807% MACs,
          (0): Conv2d(0.011 GMac, 3.384% MACs, 24, 144, kernel_size=(1, 1), stride=(1, 1), bias=False)
          (1): BatchNorm2d(0.001 GMac, 0.282% MACs, 144, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (2): ReLU6(0.0 GMac, 0.141% MACs, inplace)
        )
        (1): ConvBNReLU(
          0.001 GMac, 0.423% MACs,
          (0): Conv2d(0.001 GMac, 0.317% MACs, 144, 144, kernel_size=(3, 3), stride=(2, 2), padding=(1, 1), groups=144, bias=False)
          (1): BatchNorm2d(0.0 GMac, 0.071% MACs, 144, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (2): ReLU6(0.0 GMac, 0.035% MACs, inplace)
        )
        (2): Conv2d(0.004 GMac, 1.128% MACs, 144, 32, kernel_size=(1, 1), stride=(1, 1), bias=False)
        (3): BatchNorm2d(0.0 GMac, 0.016% MACs, 32, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      )
    )
    (5): InvertedResidual(
      0.012 GMac, 3.729% MACs,
      (conv): Sequential(
        0.012 GMac, 3.729% MACs,
        (0): ConvBNReLU(
          0.005 GMac, 1.645% MACs,
          (0): Conv2d(0.005 GMac, 1.504% MACs, 32, 192, kernel_size=(1, 1), stride=(1, 1), bias=False)
          (1): BatchNorm2d(0.0 GMac, 0.094% MACs, 192, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (2): ReLU6(0.0 GMac, 0.047% MACs, inplace)
        )
        (1): ConvBNReLU(
          0.002 GMac, 0.564% MACs,
          (0): Conv2d(0.001 GMac, 0.423% MACs, 192, 192, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), groups=192, bias=False)
          (1): BatchNorm2d(0.0 GMac, 0.094% MACs, 192, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (2): ReLU6(0.0 GMac, 0.047% MACs, inplace)
        )
        (2): Conv2d(0.005 GMac, 1.504% MACs, 192, 32, kernel_size=(1, 1), stride=(1, 1), bias=False)
        (3): BatchNorm2d(0.0 GMac, 0.016% MACs, 32, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      )
    )
    (6): InvertedResidual(
      0.012 GMac, 3.729% MACs,
      (conv): Sequential(
        0.012 GMac, 3.729% MACs,
        (0): ConvBNReLU(
          0.005 GMac, 1.645% MACs,
          (0): Conv2d(0.005 GMac, 1.504% MACs, 32, 192, kernel_size=(1, 1), stride=(1, 1), bias=False)
          (1): BatchNorm2d(0.0 GMac, 0.094% MACs, 192, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (2): ReLU6(0.0 GMac, 0.047% MACs, inplace)
        )
        (1): ConvBNReLU(
          0.002 GMac, 0.564% MACs,
          (0): Conv2d(0.001 GMac, 0.423% MACs, 192, 192, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), groups=192, bias=False)
          (1): BatchNorm2d(0.0 GMac, 0.094% MACs, 192, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (2): ReLU6(0.0 GMac, 0.047% MACs, inplace)
        )
        (2): Conv2d(0.005 GMac, 1.504% MACs, 192, 32, kernel_size=(1, 1), stride=(1, 1), bias=False)
        (3): BatchNorm2d(0.0 GMac, 0.016% MACs, 32, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      )
    )
    (7): InvertedResidual(
      0.008 GMac, 2.546% MACs,
      (conv): Sequential(
        0.008 GMac, 2.546% MACs,
        (0): ConvBNReLU(
          0.005 GMac, 1.645% MACs,
          (0): Conv2d(0.005 GMac, 1.504% MACs, 32, 192, kernel_size=(1, 1), stride=(1, 1), bias=False)
          (1): BatchNorm2d(0.0 GMac, 0.094% MACs, 192, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (2): ReLU6(0.0 GMac, 0.047% MACs, inplace)
        )
        (1): ConvBNReLU(
          0.0 GMac, 0.141% MACs,
          (0): Conv2d(0.0 GMac, 0.106% MACs, 192, 192, kernel_size=(3, 3), stride=(2, 2), padding=(1, 1), groups=192, bias=False)
          (1): BatchNorm2d(0.0 GMac, 0.024% MACs, 192, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (2): ReLU6(0.0 GMac, 0.012% MACs, inplace)
        )
        (2): Conv2d(0.002 GMac, 0.752% MACs, 192, 64, kernel_size=(1, 1), stride=(1, 1), bias=False)
        (3): BatchNorm2d(0.0 GMac, 0.008% MACs, 64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      )
    )
    (8): InvertedResidual(
      0.011 GMac, 3.369% MACs,
      (conv): Sequential(
        0.011 GMac, 3.369% MACs,
        (0): ConvBNReLU(
          0.005 GMac, 1.575% MACs,
          (0): Conv2d(0.005 GMac, 1.504% MACs, 64, 384, kernel_size=(1, 1), stride=(1, 1), bias=False)
          (1): BatchNorm2d(0.0 GMac, 0.047% MACs, 384, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (2): ReLU6(0.0 GMac, 0.024% MACs, inplace)
        )
        (1): ConvBNReLU(
          0.001 GMac, 0.282% MACs,
          (0): Conv2d(0.001 GMac, 0.212% MACs, 384, 384, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), groups=384, bias=False)
          (1): BatchNorm2d(0.0 GMac, 0.047% MACs, 384, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (2): ReLU6(0.0 GMac, 0.024% MACs, inplace)
        )
        (2): Conv2d(0.005 GMac, 1.504% MACs, 384, 64, kernel_size=(1, 1), stride=(1, 1), bias=False)
        (3): BatchNorm2d(0.0 GMac, 0.008% MACs, 64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      )
    )
    (9): InvertedResidual(
      0.011 GMac, 3.369% MACs,
      (conv): Sequential(
        0.011 GMac, 3.369% MACs,
        (0): ConvBNReLU(
          0.005 GMac, 1.575% MACs,
          (0): Conv2d(0.005 GMac, 1.504% MACs, 64, 384, kernel_size=(1, 1), stride=(1, 1), bias=False)
          (1): BatchNorm2d(0.0 GMac, 0.047% MACs, 384, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (2): ReLU6(0.0 GMac, 0.024% MACs, inplace)
        )
        (1): ConvBNReLU(
          0.001 GMac, 0.282% MACs,
          (0): Conv2d(0.001 GMac, 0.212% MACs, 384, 384, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), groups=384, bias=False)
          (1): BatchNorm2d(0.0 GMac, 0.047% MACs, 384, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (2): ReLU6(0.0 GMac, 0.024% MACs, inplace)
        )
        (2): Conv2d(0.005 GMac, 1.504% MACs, 384, 64, kernel_size=(1, 1), stride=(1, 1), bias=False)
        (3): BatchNorm2d(0.0 GMac, 0.008% MACs, 64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      )
    )
    (10): InvertedResidual(
      0.011 GMac, 3.369% MACs,
      (conv): Sequential(
        0.011 GMac, 3.369% MACs,
        (0): ConvBNReLU(
          0.005 GMac, 1.575% MACs,
          (0): Conv2d(0.005 GMac, 1.504% MACs, 64, 384, kernel_size=(1, 1), stride=(1, 1), bias=False)
          (1): BatchNorm2d(0.0 GMac, 0.047% MACs, 384, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (2): ReLU6(0.0 GMac, 0.024% MACs, inplace)
        )
        (1): ConvBNReLU(
          0.001 GMac, 0.282% MACs,
          (0): Conv2d(0.001 GMac, 0.212% MACs, 384, 384, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), groups=384, bias=False)
          (1): BatchNorm2d(0.0 GMac, 0.047% MACs, 384, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (2): ReLU6(0.0 GMac, 0.024% MACs, inplace)
        )
        (2): Conv2d(0.005 GMac, 1.504% MACs, 384, 64, kernel_size=(1, 1), stride=(1, 1), bias=False)
        (3): BatchNorm2d(0.0 GMac, 0.008% MACs, 64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      )
    )
    (11): InvertedResidual(
      0.013 GMac, 4.125% MACs,
      (conv): Sequential(
        0.013 GMac, 4.125% MACs,
        (0): ConvBNReLU(
          0.005 GMac, 1.575% MACs,
          (0): Conv2d(0.005 GMac, 1.504% MACs, 64, 384, kernel_size=(1, 1), stride=(1, 1), bias=False)
          (1): BatchNorm2d(0.0 GMac, 0.047% MACs, 384, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (2): ReLU6(0.0 GMac, 0.024% MACs, inplace)
        )
        (1): ConvBNReLU(
          0.001 GMac, 0.282% MACs,
          (0): Conv2d(0.001 GMac, 0.212% MACs, 384, 384, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), groups=384, bias=False)
          (1): BatchNorm2d(0.0 GMac, 0.047% MACs, 384, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (2): ReLU6(0.0 GMac, 0.024% MACs, inplace)
        )
        (2): Conv2d(0.007 GMac, 2.256% MACs, 384, 96, kernel_size=(1, 1), stride=(1, 1), bias=False)
        (3): BatchNorm2d(0.0 GMac, 0.012% MACs, 96, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      )
    )
    (12): InvertedResidual(
      0.023 GMac, 7.309% MACs,
      (conv): Sequential(
        0.023 GMac, 7.309% MACs,
        (0): ConvBNReLU(
          0.011 GMac, 3.490% MACs,
          (0): Conv2d(0.011 GMac, 3.384% MACs, 96, 576, kernel_size=(1, 1), stride=(1, 1), bias=False)
          (1): BatchNorm2d(0.0 GMac, 0.071% MACs, 576, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (2): ReLU6(0.0 GMac, 0.035% MACs, inplace)
        )
        (1): ConvBNReLU(
          0.001 GMac, 0.423% MACs,
          (0): Conv2d(0.001 GMac, 0.317% MACs, 576, 576, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), groups=576, bias=False)
          (1): BatchNorm2d(0.0 GMac, 0.071% MACs, 576, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (2): ReLU6(0.0 GMac, 0.035% MACs, inplace)
        )
        (2): Conv2d(0.011 GMac, 3.384% MACs, 576, 96, kernel_size=(1, 1), stride=(1, 1), bias=False)
        (3): BatchNorm2d(0.0 GMac, 0.012% MACs, 96, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      )
    )
    (13): InvertedResidual(
      0.023 GMac, 7.309% MACs,
      (conv): Sequential(
        0.023 GMac, 7.309% MACs,
        (0): ConvBNReLU(
          0.011 GMac, 3.490% MACs,
          (0): Conv2d(0.011 GMac, 3.384% MACs, 96, 576, kernel_size=(1, 1), stride=(1, 1), bias=False)
          (1): BatchNorm2d(0.0 GMac, 0.071% MACs, 576, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (2): ReLU6(0.0 GMac, 0.035% MACs, inplace)
        )
        (1): ConvBNReLU(
          0.001 GMac, 0.423% MACs,
          (0): Conv2d(0.001 GMac, 0.317% MACs, 576, 576, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), groups=576, bias=False)
          (1): BatchNorm2d(0.0 GMac, 0.071% MACs, 576, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (2): ReLU6(0.0 GMac, 0.035% MACs, inplace)
        )
        (2): Conv2d(0.011 GMac, 3.384% MACs, 576, 96, kernel_size=(1, 1), stride=(1, 1), bias=False)
        (3): BatchNorm2d(0.0 GMac, 0.012% MACs, 96, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      )
    )
    (14): InvertedResidual(
      0.016 GMac, 5.011% MACs,
      (conv): Sequential(
        0.016 GMac, 5.011% MACs,
        (0): ConvBNReLU(
          0.011 GMac, 3.490% MACs,
          (0): Conv2d(0.011 GMac, 3.384% MACs, 96, 576, kernel_size=(1, 1), stride=(1, 1), bias=False)
          (1): BatchNorm2d(0.0 GMac, 0.071% MACs, 576, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (2): ReLU6(0.0 GMac, 0.035% MACs, inplace)
        )
        (1): ConvBNReLU(
          0.0 GMac, 0.106% MACs,
          (0): Conv2d(0.0 GMac, 0.079% MACs, 576, 576, kernel_size=(3, 3), stride=(2, 2), padding=(1, 1), groups=576, bias=False)
          (1): BatchNorm2d(0.0 GMac, 0.018% MACs, 576, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (2): ReLU6(0.0 GMac, 0.009% MACs, inplace)
        )
        (2): Conv2d(0.005 GMac, 1.410% MACs, 576, 160, kernel_size=(1, 1), stride=(1, 1), bias=False)
        (3): BatchNorm2d(0.0 GMac, 0.005% MACs, 160, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      )
    )
    (15): InvertedResidual(
      0.016 GMac, 4.926% MACs,
      (conv): Sequential(
        0.016 GMac, 4.926% MACs,
        (0): ConvBNReLU(
          0.008 GMac, 2.394% MACs,
          (0): Conv2d(0.008 GMac, 2.350% MACs, 160, 960, kernel_size=(1, 1), stride=(1, 1), bias=False)
          (1): BatchNorm2d(0.0 GMac, 0.029% MACs, 960, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (2): ReLU6(0.0 GMac, 0.015% MACs, inplace)
        )
        (1): ConvBNReLU(
          0.001 GMac, 0.176% MACs,
          (0): Conv2d(0.0 GMac, 0.132% MACs, 960, 960, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), groups=960, bias=False)
          (1): BatchNorm2d(0.0 GMac, 0.029% MACs, 960, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (2): ReLU6(0.0 GMac, 0.015% MACs, inplace)
        )
        (2): Conv2d(0.008 GMac, 2.350% MACs, 960, 160, kernel_size=(1, 1), stride=(1, 1), bias=False)
        (3): BatchNorm2d(0.0 GMac, 0.005% MACs, 160, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      )
    )
    (16): InvertedResidual(
      0.016 GMac, 4.926% MACs,
      (conv): Sequential(
        0.016 GMac, 4.926% MACs,
        (0): ConvBNReLU(
          0.008 GMac, 2.394% MACs,
          (0): Conv2d(0.008 GMac, 2.350% MACs, 160, 960, kernel_size=(1, 1), stride=(1, 1), bias=False)
          (1): BatchNorm2d(0.0 GMac, 0.029% MACs, 960, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (2): ReLU6(0.0 GMac, 0.015% MACs, inplace)
        )
        (1): ConvBNReLU(
          0.001 GMac, 0.176% MACs,
          (0): Conv2d(0.0 GMac, 0.132% MACs, 960, 960, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), groups=960, bias=False)
          (1): BatchNorm2d(0.0 GMac, 0.029% MACs, 960, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (2): ReLU6(0.0 GMac, 0.015% MACs, inplace)
        )
        (2): Conv2d(0.008 GMac, 2.350% MACs, 960, 160, kernel_size=(1, 1), stride=(1, 1), bias=False)
        (3): BatchNorm2d(0.0 GMac, 0.005% MACs, 160, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      )
    )
    (17): InvertedResidual(
      0.023 GMac, 7.281% MACs,
      (conv): Sequential(
        0.023 GMac, 7.281% MACs,
        (0): ConvBNReLU(
          0.008 GMac, 2.394% MACs,
          (0): Conv2d(0.008 GMac, 2.350% MACs, 160, 960, kernel_size=(1, 1), stride=(1, 1), bias=False)
          (1): BatchNorm2d(0.0 GMac, 0.029% MACs, 960, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (2): ReLU6(0.0 GMac, 0.015% MACs, inplace)
        )
        (1): ConvBNReLU(
          0.001 GMac, 0.176% MACs,
          (0): Conv2d(0.0 GMac, 0.132% MACs, 960, 960, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), groups=960, bias=False)
          (1): BatchNorm2d(0.0 GMac, 0.029% MACs, 960, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (2): ReLU6(0.0 GMac, 0.015% MACs, inplace)
        )
        (2): Conv2d(0.015 GMac, 4.701% MACs, 960, 320, kernel_size=(1, 1), stride=(1, 1), bias=False)
        (3): BatchNorm2d(0.0 GMac, 0.010% MACs, 320, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      )
    )
    (18): ConvBNReLU(
      0.02 GMac, 6.326% MACs,
      (0): Conv2d(0.02 GMac, 6.267% MACs, 320, 1280, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (1): BatchNorm2d(0.0 GMac, 0.039% MACs, 1280, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (2): ReLU6(0.0 GMac, 0.020% MACs, inplace)
    )
  )
  (classifier): Sequential(
    0.001 GMac, 0.400% MACs,
    (0): Dropout(0.0 GMac, 0.000% MACs, p=0.2)
    (1): Linear(0.001 GMac, 0.400% MACs, in_features=1280, out_features=1000, bias=True)
  )
)
Flops:  320.24 MMac
Params: 3.5 M
